{"张公桥街道": "演武街社区 徐家扁社区 文昌宫社区 王浩儿社区 圣水街社区 北门桥社区 石雁儿社区 青果山社区"}
{"龚嘴镇": "红星社区 金牛村 万坪村 刘沟村 长江村 杨岗村"}
{"碧山乡": "碧山社区 四方村 铁寨村 龙神村 踩泥村 马鞍村 柏林村 凉水村 两河口村 连沟村 蜜蜂村 海棠村 中桥村 安乐村 江红村"}
{"谭坝乡": "谭坝社区 谭坝村 挹峨村 大同村 永丰村 绿化村 玉禅村 沫江村 廖湾村"}
{"轸溪乡": "轸溪社区 富民村 双山村 轸溪村 寨子村 红岩村"}
{"范店乡": "范店社区 五七村 代湾村 李子坪村 先峰村 罗山村"}
{"葫芦镇": "葫芦社区 葫芦坝村 人民村 龙洞村 白叶村 江村村 徐沟村 四峨村 太平村 汪山村 梁村村 王坝村 祝村村"}
{"铜茨乡": "铜茨社区 老街村 龙柱村 青冈坪村 园坝村 安池村 营业村 江山村"}
{"踏水镇": "踏水社区 踏水村 石埂村 金河村 公坪村 长坪村 新德村 魏槽村 黄坝村"}
{"嘉农镇": "嘉农社区 沫东坝村 新都村 新泉村 新园村 新兴村 魏坝村 王场村 白岩村 齐安村 加华村 双槐村 燎原村 分场"}
{"牛石镇": "牛石社区 豆地坪村 朝山村 油堰村 喻坝村 利农村 骑龙村 邓坪村 白云村"}
{"杨湾乡": "沙井村 刘浩村 红阳村 陶村村 张山庙村 灵官村 唐村村 长虹村 长春村 街村村"}
{"福禄镇": "福禄社区 农科村 平原村 沙湾儿村 罗家湾村 费林湾村 干坝子村 黄泥坡村 万福桥村 燕子坎村 岚坝村 公店村 大坪村 塘沟村 雷店村 黑牛地村 凉风埂村 水凼子村 观房寺村"}
{"黄湾乡": "报国村 张坝村 黄弯村 梁坎村 新桥村 龙门村 雷岩村 大峨村 茶场村 张山村 万年村 木瓜村 黑水村 茶地村 桅杆村 龙洞村"}
{"沙湾镇": "南陵社区 沫水社区 绥山社区 观峨社区 余溪社区 乐轧社区 天车村 忠心村 三峨村 顺河村 王田村 余溪村 农场 世坪村"}
{"太平镇": "太平社区 罗一村 付塘村 天顺井村 稻麦村 五高山村 老码头村 草坝村 杜家桥村 费槽村 张湾村 双星村 杨村坝村 马胡埂村 月咡坝村 肖店村 孙坝村"}
{"平兴乡": "滑石村 平兴村 陈坝村 三圣村 胡村村 穿山村 双塘村 高冲村 街村村"}
{"新平乡": "新民村 万福村 仙塘村 净安村 新建村 汪坝村 任严村"}
{"川主乡": "蔡郎村 杨河村 太阳村 荷叶村 东岳村 兴容村 赵河村 梧桐村 顺河村 高河村"}
{"大为镇": "大为村 射箭村 双桥村 楠香村 红花村 桃花村 林家村 双河村 群达村 中坪村 民主村 巨新村 金村村 中山村 双峨村 泉水村 合龙村"}
{"普兴乡": "福利村 永安村 仙牙村 大河村 合兴村 石炉村 青春村 鸣凤村 凌云村 华龙村 合江村 联盟村 光明村 仙钟村 张岩村 胡场 双邑村 安全村 凉风村"}
{"沙溪乡": "连峨村 袁岗村 桃林村 大岗村 迥龙村 兴宏村 林坝村 七里村 新路村"}
{"龙门乡": "毛天村 黄店村 鸭池村 大村村 杨漩村 戴坪村 周山村 杨林村 天池村 王山村 草池村 玉兰村"}
{"胜利镇": "桑园社区 钟鼓社区 胜利村 红星村 月南村 熊岗村 光荣村 夏荷村 干河村 十里村"}
{"峨山镇": "马路桥社区 中王村 吴岗村 惠邻村 冠峨村"}
{"符溪镇": "径山社区 新乐村 天宫村 菜场 符溪村 符泉村 符平村 黑桥村 汪坪村 明星村 雷场 澜凼村 战斗村 友谊村 钢铁村 丰收村"}
{"乐都镇": "兴隆社区 新农村 新堰村 新和村 红卫村 园通村 顺江村 新沟村"}
{"永红乡": "罗垮村 五马村 团包子村 柱上村"}
{"九里镇": "文昌社区 兴胜村 林场 兴阳村 临江村 付河村 刘浩村 农场 白衣村 车箭村 吴庵村 三义村 汪家村 李桥村 方碾村 宋塆村"}
{"高桥镇": "中兴社区 高桥村 严寺村 汪坎村 观音村 黄茅村 张沟村 福田村 万槽村 余村村 云福村 两河村 王李村 杨寺村 寨子村"}
{"绥山镇": "万寿宫社区 白龙社区 滨河路社区 三台山社区 城东社区 红华苑社区 城南村 城西村 星昇村 大南村 五一村 安川村 光辉村 符汶村 太泉村 大庙村 洪川村 三界村 麻柳村 天全村 沈山村 盐井村 炳灵村 斗量村"}
{"高卓营乡": "高卓营村 西泥沟村 干溪拉达村 大院子村 大河坝村"}
{"双福镇": "四桥社区 双福村 同兴村 五星村 陈岗村 石岗村 江场 三江村 尖峰村 纸厂村 小河村 李河村 净居村 张岗村 新华村 黄龙村 冯岗村 塘房村 露华村 林园村"}
{"三河口乡": "三河口村 扇子湾村 白岩子村 月儿坝村 星星村 涉水坝村 先家普村 金家沟村"}
{"沙腔乡": "沙腔村 干田坝村 鄢家碉村 核桃坪村 二坪村"}
{"梅子坝乡": "梅子坝村 瓦曲窝村 瓦候库村 楠木坪村"}
{"龙池镇": "滨湖社区 杨村铺社区 龙池村 杨柳村 三湾村 白果村 宋坝村 万村村 幺店村 富有村 金川村 高万村 凤凰村 马坪村 莲花村 太平村 桃源村 烽火村 河心村 丁坪村"}
{"罗目镇": "青龙社区 鞠安村 和平村 水井村 雷村村 建新村 林村村 白马村 胡村村 廖林村 徐塘村 杨村村 阳光村 高枧村 中心村 卢山村 刘山村 郭坪村 川主村"}
{"袁家溪乡": "建设村 庄家坝村 袁家溪村 额洛村"}
{"苏坝乡": "胜利社区 向阳村 前进村 越胜村 峰溪村 白杨槽村"}
{"烟烽乡": "烟峰社区 梅子弯村 二坝村 白家弯村 大风顶村"}
{"大竹堡乡": "大竹堡村 新山村 白岩湾村 朝阳坪村"}
{"雪口山乡": "羊店儿村 谢家岩村 黎明村 拦马埂村 永兴村 田儿湾村 天花水村 温水凼村"}
{"荍坝乡": "石丈空村 双河村 茶叶村 会步村 龙桥村 东升村 水平溪村 金华村 春林村"}
{"民主乡": "丰产村 光华村 东湾村 油房村 龙秧坪村 大田村 雪峰村 小谷溪村 玛瑙村"}
{"石梁乡": "永宁村 永和村 团结村 高峰村"}
{"建设乡": "三溪村 光辉村 联河村 水流板村 高石头村 黄茅埂村 湾儿沟村"}
{"老河坝乡": "灯塔村 坪和村 惠定村 桃溪村"}
{"下溪乡": "共和街社区 观音岩村 大池塘村 龙沱沟村 珍珠桥村 鱼仓山村 孙家山村 金马村"}
{"桂花桥镇": "明园社区 友谊社区 新复村 新联村 红山村 庙稿村 红旗村 前进村 前锋村 优胜村 棬鱼村 幸福村 燕岗村 友爱村 灯塔村 团结村 折楼村 五爱村 红光村 蔡村村 彭桥村"}
{"劳动乡": "柏香村 金星村 笆子房村 先锋村 福来村 柏林村 红椿村"}
{"勒乌乡": "勒乌村 祖马村 余坪村 柑子口村 甲瓦村 山峰村"}
{"民建镇": "民建社区 城南社区 张坝社区 光明社区 红旗社区 西城村 建新村 兴隆村 灯杆堡村 水碾坝村"}
{"荣丁镇": "解放街社区 新华村 凤凰村 桐林村 裕坪村 马脑村 新桥村 光荣村 后池村"}
{"镇江庙乡": "两河口村 石龙门村 阴心岩村"}
{"金岩乡": "俄罗村 挖吉村 罗卜村 金岩村 共和村 团结村 热水村 温泉村 挖托村"}
{"平等乡": "观慈村 光明村 高岩村 清溪村 战斗村 和平村"}
{"杨河乡": "高湾村 茶园村 牟加村 张加村 仲子村 垭垭村"}
{"共和乡": "江峨村 双峨村 白果村 赵山村 红旗村"}
{"红花乡": "双桥村 兰家沟村 太平村 幸福村 同心村"}
{"黑竹沟镇": "黑竹沟社区 底底古村 西河村 依乌村 古井村 马杵千村"}
{"杨村乡": "四坪村 李子坪村 上云村 大坪村 木厂村"}
{"宜坪乡": "宜坪村 庙岗村 红岩村 泉水村 群力村 桐花村 草坪村"}
{"新场乡": "新凤村 庞沟村 桃花村 星星村 羊子岩村 长虹村"}
{"新林镇": "金星村 黄泥村 麻柳村 江湾村 九龙村 红椿村 大香村 楠木村 卷木村 水井村 瓜芦村 茗新村"}
{"五渡镇": "五渡社区 工农村 先锋村 街村村 胡坝村 田村村 双凤村 新街村 茶店村 大村村 胜利村 葛村村 郭坝村 向阳村"}
{"毛坪镇": "毛坪社区 中心村 建华村 等分村 上游村 恒心村 茶云村 长梯村 高山村 凡山村 灵凤村 老丫村"}
{"沙坪镇": "景阳社区 大坪社区 顺河社区 蔬菜村 新声村 双河村 中坪村 河沟村 六丰村 峨星村 红星村 郭凡村 雪山村 马嘶溪村 岩悬村 月包村 松林坡村"}
{"哈曲乡": "瓦嘎村 解放村 巴溪村"}
{"凤村乡": "龙凤坝社区 富强村 龙宝村 羊山村 桂香村 沙坝村 红桥村 隆兴村 三荫村 建国村 山庄村 水堡村"}
{"大堡镇": "大堡社区 新丰村 火花村 较场村 桥楼村 集广村 茶丰村 联合村 九家村 双溪村 化林村"}
{"万坪乡": "约嘎村 冷其村"}
{"白杨乡": "杨柳村 月河村 瓦洛村"}
{"茨竹乡": "朝天马社区 西门村 桐林村 五四村 凉井村 寺坪村 干沟村 茶坪村 友爱村 青龙村 雄心村"}
{"武圣乡": "罗山村 柏杨村 红星村 桂花村 新民村 草坪村 石马村 新店村 炮房村 白凤村 苦竹村 罗沟村 德胜村"}
{"杨村乡": "杨村坝社区 桢楠村 新坝村 茨岩村 两路村 梭堂村 碑坪村 硝坝村 黄沙村 龙洞村"}
{"底堡乡": "月耳台社区 五通村 卫国村 花园村 莺歌村 联合村 麻柳村 龙沱村 水月村 五显村"}
{"富和乡": "清凉村 宋村村 石盘村 蓝林村 岩湾村 花山村 虎栖村"}
{"幸福乡": "五宝村 龙门村 白果村 柏香村 松林村 茅坪村 火岩村 杨柳村 共和村 月坝村"}
{"炭库乡": "罗家坝社区 太平村 新开村 友谊村 茶林村 乐园村 石碑村"}
{"新凡乡": "钟灵场社区 新塘村 双石村 筒车村 罗柘村 小河村 小林村 水井村 凉风村 卡防村 峰岩村 木香村 太和村"}
{"海云乡": "和平村 同心村 严湾村 青山村"}
{"高笋乡": "康乐社区 民主村 龙河村 静云村 龙槽村 谷坝村 张岩村 杨湾村 光明村 安平村 川桥村"}
{"利店镇": "利民坝社区 大桥村 后山村 大田村 桥头村 大坪村 回龙村 涧溪村 三河村 楼房村 朝阳村 珠溪村 天坪村 老林村"}
{"黄丹镇": "太和堂社区 赵坝村 大碑村 加禾村 钟坪村 里坪村 芋荷村 山田村 胡湾村 铁炉村 罗岩村"}
{"建和乡": "官田村 凤凰村 沙溪村 河口村 下坪村 桃花村 石围村 庙坪村"}
{"舟坝镇": "花山湾社区 正兴村 普宁村 洋溪村 彭槽村 夏寨村 前进村 桃山村 弓弯村 先锋村 桑林村 双堰村 场坝村 乐群村 工农村 兴隆村"}
{"箭板镇": "马湖社区 福田村 五星村 中和村 安乐村 尹安村 久和村 庆元村 行路村"}
{"大楠镇": "大楠坳社区 禾加村 四河村 新场 金盆村 文昌村 龙水村 义和村 建农村 高山村 白云村 麻秧村 石堰村 李子村 水口村"}
{"沐溪镇": "农场坝社区 三观楼社区 梨园社区 围墙村 前光村 胜利村 茨梨村 团结村 石桥村 关坪村 茨弯村 阳雀村 泥河村 黄龙村 仁厚村 龙桥村 石梁村 三溪村"}
{"南安乡": "兰坝社区 王宿村 联丰村 邓山村 显岗村 夏岗村 明水村 白岩村 马沟村 张口村 丁字村"}
{"觉莫乡": "茨竹村 马鞍村 为觉村"}
{"龙沱乡": "龙沱村 修文村 三合村 赵沟村 联乡村 张山村 分水村"}
{"迎江乡": "群星村 郭坪村 双鱼村 双龙村 东岳村 大桥村 黄祠村 石香村 古埝村 大兴村 师坝村"}
{"歇马乡": "余湾社区 小溪村 甘溪村 代坪村 杨山村 尖峰村 立新村 幸福村 联合村 新林村"}
{"麻柳乡": "关口村 大明村 山青村 前峰村 佛鹰村 西陵村 建乡村"}
{"梧凤乡": "黎明村 杨冲村 王坎村 余沟村 红华村 朱坝村"}
{"新场镇": "安子社区 星和社区 江山村 普益村 黄林村 新场 肖坪村 合兴村 红旗村"}
{"甘霖镇": "大石桥村 席河村 宝华村 新生村 南山村 民主村 文沟村 朝阳村 定惠村 板桥村"}
{"华头镇": "川溪社区 沙湾村 塘边村 黄村村 兰草村 金山村 沙坝村 学林村 清水村 白甲村 陈山村 楼房村 正街村"}
{"永福镇": "田家坝社区 新桥村 双河村 万寿村 油房村 永兴村 新华村 星海村 张村村 楠木村 茶园村 同福村"}
{"青州乡": "慈影社区 东山村 建国村 金河村 金星村 团结村 魏沟村 紫荆村 石滩村"}
{"马村乡": "马村社区 带河村 水库村 方沟村 彭嘴村 上村村 碧山村 金华村 石埝村 石窖村 张岩村 沙咀村"}
{"木城镇": "街道社区 大旗村 新农村 汉柏村 太坪村 中坝村 郑村村 代桥村 桂香村 白庙村 泉水村 石柱村 兰田村 民安村 白果村 五里村"}
{"土门乡": "土门铺社区 铁道村 民益村 骑江村 交通村 万福村 白云村 江祠村"}
{"永青乡": "丰收村 永兴村 光荣村 爱国村 凉风村"}
{"顺河乡": "同心社区 前进村 上游村 正觉村 山河村 蔡河村 龙兴村 宿坪村"}
{"吴场镇": "金牛社区 杨村村 熊村村 龙华村 白龙村 汪口村 五显村 柏林村 董沟村 董坪村 建设村 洪川村 宝灵村"}
{"甘江镇": "甘江铺社区 席湾村 盘渡村 新民村 界牌村 圣本村 大坪村 春林村 付祠村 鞠村村 大元村 双碑村 吉祥村 万华村 五星村 李村村 陶渡村 中心村 大同村 河西村 胜利村 艾中村"}
{"三洞镇": "三洞桥社区 建新村 恒心村 仁心村 双路村 汪家村 共兴村 郑扁村 周冲村 齐心村"}
{"中兴镇": "大路坎社区 王埝村 周庵村 大路坎村 内碾村 龚沟村 杨湾村 高洞口村 李咀村 方井村 七郎村 李沟村"}
{"界牌镇": "甘河子社区 凤山社区 江村社区 韩沟村 郭沟村 马鞍村 周柏村 青江村 周坝村 蔡沟村 鸣凤村 鱼市村 联盟村"}
{"黄土镇": "黄土社区 凤桥社区 罗华社区 雷店村 茶坊村 张桥村 万松村 潘塘村 东风村 东月村 水口村 红光村 马坝村 马冲村 程河村"}
{"乌抛乡": "乌抛街社区 玉皇顶村 团包村 乌抛村 蔡家桥村 牛旺村 绵流村 狮子村"}
{"天云乡": "街道社区 天湖村 两河村 瓦子坳村 龙申村 毛坝村"}
{"大佛乡": "大佛街社区 龙凤桥村 金紫村 黄桷村 大佛村 团结村 大力村"}
{"镇阳乡": "镇阳街社区 镇阳村 石龙村 云峰村 毛坝场 凉风村 兴隆村 石牛坝村"}
{"漹城镇": "牌坊社区 新华社区 工农社区 和平桥社区 迎春社区 滨江社区 在古社区 杨柳社区 谢滩社区 新村村 何村村 薛村村 宋河村 永胜村 雷塘村 宿漕村 桃坡村 任山村 大石村 千佛村"}
{"门坎乡": "建设街社区 门坎村 大水湾村 观音村 白合村 马道村"}
{"分全乡": "分全街社区 群力村 全胜村 天乐村 骑龙村 红庙村 青龙村"}
{"金峰乡": "街道社区 金峰村 平店村 东方红村 卫东村 黄马村 火光村 战斗村"}
{"宝五乡": "宝五街社区 五爱村 塘湾村 五龙场 桂花村 三溪村 曙光村"}
{"黄钵乡": "黄钵街社区 黄钵井村 黄泥敖村 七盘山村 邓家咀村 椒子湾村"}
{"高滩乡": "增建村 五龙井村 利群村 高滩村 高石村 双鹅村 五谷村"}
{"高凤乡": "高凤街社区 潜力村 红星村 建国村 星星亮村 星光村 高凤村 雨凤村 有力村 同力村 节约村 双堰村"}
{"纯复乡": "街道社区 田家沟村 锣心村 观塘村 尖钵村 跃进村 永乐村"}
{"胜泉乡": "胜泉街社区 胜泉村 川山洞村 石民村 竹林村"}
{"三教乡": "三教社区 三教村 高庙村 瓦窑村 大光明村"}
{"集益乡": "街道社区 向阳村 赛功村 雨台村 幸福村 界牌村 繁荣村"}
{"四合乡": "街道社区 劳动村 里仁村 大山村 齐心村 四合村 石桅村"}
{"三江镇": "三江街社区 三江村 金仓村 石庙村 新胜村 同意村 月波村 解放村"}
{"磨池镇": "新荣街社区 磨池村 元丰村 龙池村 金家沟村"}
{"石牛乡": "石牛街社区 大胜村 桐子村 石牛村 新塘村 东云村"}
{"千佛镇": "千佛街社区 千佛村 高岩村 新群村 民建村 梅家湾村 石家桥村 共裕村 汤家寺村 瓦子坝村"}
{"东林镇": "东林街社区 东光村 先锋村 打鼓滩村 平安村 高佳村 汀泗村 寨子村 沙溪村 红花村"}
{"竹园镇": "竹园街社区 烈士村 通光村 大坪村 桥湾村 广新村 高石坎村 德银村"}
{"周坡镇": "周坡街社区 周坡村 团山村 友盟村 龙桥村 大河村 石马村"}
{"王村镇": "王村街社区 杨家河村 集体村 永兴村 小桥子村 石坝村 五农村 长乐村 碑岩村 佛咡岩村 红专村 梅旺村 石塔村"}
{"研经镇": "研经街社区 横连村 共富村 断桥村 大河井村 同前村 大团村 青春村 红光村 石堰村 龙潭村 全福村 农新村 五同村 四方村 柏家村 王家沟村"}
{"伏龙乡": "伏龙场社区 丛林村 砖房村 黄泽村 葵花村 光明村 向阳村 前进村 黄桷村 新建村 一心村 三冲村"}
{"公平乡": "公平社区 安乐村 仁义村 花坪村 凉桥村 堰上村 竹根村 窗子村 三联村 利泉村 三溪村 慈云村"}
{"马踏镇": "马踏街社区 马踏村 五里湾村 南河村 桥咡井村 红五月村 石泉村 八一村 清河村"}
{"马庙乡": "马王庙街社区 小村村 成新村 治安村 天池村 藕花村 白果村 集和村 顶塘村 莲花村 十月村 小林村"}
{"研城镇": "民主街社区 和平街社区 建设路社区 顺河街社区 白塔街社区 夏家桥街社区 城南社区 来凤村 幸福来村 宋高山村 同心村 飞跃村 红太阳村 楼房冲村 造福村 新道路村 新兴村 建新村 高家寺村 三合村 霁虹村 高坡村 塘角村 建华村 化里村"}
{"下渡乡": "下渡口街社区 文碧村 石龙村 永忠村 凯旋村 向荣村 双河村 三合村 共和村 沙坝村 中和村 柏杨村"}
{"岷东乡": "观音寺社区 沙嘴村 大湾村 金鸡村 平安村 葫芦村 骑凤村"}
{"玉屏乡": "观音场社区 玉屏村 新桥村 杨柳村 建设村 金钱沟村 响滩村 大桥村 新民村 四联村 楠木村"}
{"舞雩乡": "舞雩场社区 双桥村 玉泉村 康乐村 熊马村 银桥村 高河村 金光村 高龙村 石坝村"}
{"新盛乡": "新场社区 新场 柏山村 太平村 新金村 红旗村"}
{"塘坝乡": "塘坝口街社区 塘房村 牛心村 高家村 新房村 尖山村 镇江村 跃进村 向坪村 白家村 爱国村 红光村"}
{"南阳乡": "南阳社区 红蓉村 星火村 民群村 梨树村 筠山村 双龙村"}
{"同兴乡": "小市村 永红村 三八村 九三村 灯塔村 坳口村 分水岭村 艾村村 翻身村"}
{"榨鼓乡": "榨鼓场社区 永丰村 观堂村 麻柳村 百花村 芭蕉村 塘沟村 回龙村 塘口村 双黄村"}
{"铁炉乡": "铁炉场社区 兴隆村 文池村 高峰村 安南村 农宁村 朝阳村 桂花村 宏农村"}
{"纪家乡": "街道社区 龙泉村 长沙村 鱼石村 柑子村 卓坪村 玉河村 松柏村"}
{"大兴乡": "大兴场社区 太阳坡村 雪花村 青和村 民乐村 叶荷村 云峰村 梧桐村 白马村 清华村 黄荆村"}
{"寿保乡": "寿保场社区 刘坝村 盐坝村 双成村 三湾村 油房村 大坡村 旺家村 邓坝村 花金村 文昌村 四房村"}
{"双溪乡": "柳溪村 长坪村 合水村 铁铜村 松林村 兰花村 牛岭村 双溪村 楠林村 硝水村 天平村"}
{"九井乡": "街道社区 佳沟村 长山村 峰门村 金鼓村 鱼滩村 九井村 罐山村"}
{"敖家镇": "敖家场社区 桂坪村 先进村 水井村 狮坝村 棉花村 健康村 桅杆村 青山村 卫星村 菜花村 林峰村 光芒村 先锋村 龙凤村"}
{"金石井镇": "冶官社区 五四村 五联村 塘湾村 金民村 塘河村 新武村 群英村 万年村 大沟村 团结村 民忠村 中山村 青松村 柏林村"}
{"芭沟镇": "芭蕉沟社区 三井社区 火光村 民主村 光辉村 铁牛村 水星寨村 新村村 焦坝村 工农村"}
{"龙孔镇": "龙孔场社区 曙光村 建新村 晏佳村 公平村 龙华村 协力村 新锦村 陈佳村 乐和村 茂盛村 康村村 丝茅坪村 新开村 文峰村 陶家村 黎明村 四民村 老文滩村 石燕村"}
{"罗城镇": "滴水岩社区 杨家湾社区 船形街社区 坳塘村 太阳村 同心村 繁荣村 石桩村 大山村 七星村 新权村 二龙村 新光村 新星村 幸福村 铁山村 菜佳村 铁岭村 青狮村 青峰村 大石村 兴福村 白鹤村 沙地村 长龙村 白云村 新农村 新和村 新华村"}
{"定文镇": "定文场社区 洪流村 新生村 方井村 上场村 金山村 金凌村 永乐村 大水村 炮房村 四和村 丝房村"}
{"清溪镇": "交通街社区 建新街社区 筒车村 胭脂村 百箩村 三山村 洛阳村 洛江村 踏水村 灌引村 沉犀村 渠成村 龙门村 天山村 丁家村 南岸村 永星村 盐坪村 新乐村 龙兴村 康家村 祗园村 永安村 保安村 七一村 上游村 五龙村 和平村"}
{"孝姑镇": "孝姑街社区 八一村 永平村 田佳村 红久村 沙湾村 石盘村 百支溪村 东风村 五一村 同益村 紫云村"}
{"新民镇": "麻柳场社区 板桥村 土坪村 新塘村 凉坪村 岩门村 刘家村 天星村 胜利村 宫堂村 斑竹村 金田村 光华村 高洞村 雨台村 云谷村 五同村 观音村 新云村 凉风村 金凤村 马儿山村 红岩村 中心村 农荣村 狮子村 火箭村"}
{"永胜乡": "花茨村 五池村 大坪村 和平村 民主村 建设村 桅杆村 顺河村"}
{"玉津镇": "凤岭社区 学府社区 西街社区 玉津社区 漱玉社区 河口朱石滩街社区 南盐社区 凤凰社区 互和社区 瑞雪社区 联合村 铜高村 机场 和风村"}
{"石溪镇": "民乐社区 凉桥社区 河西村 大坪村 前丰村 保卫村 小二河村 桃花村 姜沟村 勤俭村 画眉村 联盟村 深沟村 戴家坪村 石马村"}
{"吉星乡": "金星村 同心村 联合村 民政村 柏香村"}
{"共安彝族乡": "新村村 新建村 小河村 文店村 象鼻村 大板村 林丰村"}
{"金河镇": "金河社区 铜河村 五星村 五一村 吉丰村 大杠村 曙光村 灯塔村 茶坪村 廖坪村 黎明村"}
{"泉水镇": "泉水场社区 贾坝村 天生桥村 牛骑村 双山村 李湾村 康跃溪村 三块田村 泉水村 陈家榜村 周家沟村 黄家山村 苦竹林村"}
{"永和镇": "滨河路社区 和平社区 官村社区 新民村 新乐村 新华村 新光村 胜利村"}
{"和平彝族乡": "罗回村 解放村 迎新村 迎春村 桠溪村 蒲梯村"}
{"新云乡": "灯杆村 真武村 加阳村 新云村 中华村 上游村 燕山村 华联村 农乐村 代河村"}
{"石麟镇": "麒麟街社区 方嘴村 兴无村 杨林坳村 阳光村 共同村 水保源村 许店儿村 碗厂村 程河沟村 飞来村 南山村 白房子村 莲池村 楼房山村 沙坝河村 美丽村 马儿石村 张坳口村 大桥村"}
{"辉山镇": "劳动街社区 争鸣村 杏林村 杏花村 红十月村 灯塔村 先家村 桐麻村 民安村 六塘村"}
{"冠英镇": "玉津街社区 青乐村 天池村 马桑村 荣丰村 麦子坳村 鸭口山村 黄益塘村 兴福村 石子埂村 新街口村 大兴庙村 徐坝村 河桥村 挖断山村 许村村 尚村村 章庙村 双龙庵村 诸益村 龙埂村 双河村 仙女井村 神佛村"}
{"金山镇": "金山寺社区 红星村 新房子村 陈家寺村 苦竹嘴村 石燕子村 碾子湾村 光华村 新民村 新桥村 白家磅村 盐井沱村 星光村 金玉村 柏木林村 石牛村 皂角村 增产村 金家滩村"}
{"蔡金镇": "蔡金场社区 七仙村 瓢咡井村 黄店村 官斗村 复兴村 朱庙村 天林村 李子村 永镇村 团山村 中心村 石河村 燕湾村 玉井村"}
{"杨柳镇": "杨柳湾社区 杨柳村 翻身村 瓦窑村 青龙村 多宝村 万里村 龙门坝村 柑子村 红军村 红豆村"}
{"竹根镇": "两河口社区 佑君社区 黄桷井社区 涌江社区 茶花社区 市建会社区 岷江社区 新华村 茶花村 幸福村 易坝村"}
{"牛华镇": "二码头社区 碳坝市社区 半边街社区 巴岩井社区 沙板滩社区 三塔村 塘叶村 观音堂村 顺山村 三江村 高山步村 星火村 解放村 群众村 路边村 浸水村 沔坝村 杉树村 汤家坝村 石江村"}
{"迎阳乡": "迎阳村 前进村 四合村"}
{"沫江办事处": "草坝社区 老矿社区 修养院社区"}
{"凌云乡": "新场社区 龙泉村 向阳村 邓庵村 徐店村 双福村 三尊村 凌云村"}
{"九龙乡": "九龙村 双狮村 沙墩村"}
{"普仁乡": "普仁村 陈桥村 社峰村 鹤桥村 街村村"}
{"剑峰乡": "凉风村 牛心村 团结村 友爱村 联合村 共和村 桂花村 五星村 新塘村 石桥村 群乐村 街村村"}
{"石龙乡": "乐加村 平和村 红月村 松柏村 流村村 努力村 街村村"}
{"关庙乡": "花台村 雷沟村 苏坪村 建国村 桥咡店村 板桥村 东林村 三峡村 街村村"}
{"金粟镇": "姜市街社区 磨子街社区 金江村 一江村 印盒山村 双漩村 刘家山村 五一村 庙儿山村"}
{"桥沟镇": "桥兴社区 老龙坝村 平桥村 会云村 张家山村 共裕村 井房坳村"}
{"悦来乡": "犁头湾村 鱼窝村 石膏村 范石坎村 柏杨坳村 荔枝湾村 道华村 龙岩村 街村村"}
{"西坝镇": "西溶社区 建新村 三和村 同心村 爱国村 长征村 前丰村 高河村 民权村 和平村 建益村 高峰村 新春村 向荣村 庙沱村 民益村"}
{"车子镇": "车子山社区 洛都社区 惠安村 杜家场 金灯村 茶山村 白堰村 平安村 老江村 渔龙村"}
{"临江镇": "太平场社区 砖房村 隔河村 立新村 跃进村 游坝村 稻禾香村"}
{"九峰镇": "钓鱼台社区 鞍山村 棕桥村 明月村 永安村 尖山村 源安村 青衣坝村"}
{"罗汉镇": "罗汉场社区 双庙村 罗金村 黄荆村 龙窝村 王沟村 华光村 新乐村 香超寺村 高河村"}
{"童家镇": "童家场社区 红光村 童家村 光明村 农甫村 开化村 棉花村 胜西村 红旗村 毛家堰村 建设村 凤凰村 朝阳村"}
{"棉竹镇": "棉竹铺社区 袁坝村 高坝村 张铺儿村 石桥冲村 天空山村 九百洞村"}
{"苏稽镇": "苏稽街社区 新桥街社区 沙嘴街社区 双红村 青峨村 红专村 徐浩村 蚕桑村 顺江村 饶坎村 楠元村 勤业村 双全村 卫东村 工农村 新联村 倒拐店村 获坪村 程扁村 杨平村 永和村 高山铺村 曾河坝村 龙滩尾村 杨军坝村"}
{"安谷镇": "民和社区 安谷村 王元村 烽火村 官帽村 龙星村 七星村 上王村 双水村 龙口村 英雄村 郑明村 刘河村 迴龙村 二郎村 泊滩村 高山村 大龙村"}
{"全福镇": "裕农场社区 裕农村 台子村 夏沟村 石梯村 全福村 普农村 石农村"}
{"白马镇": "白马街社区 司马桥社区 黄石社区 汇鑫社区 新联村 联四村 柏树村 董家村 和平村 千子村 红莲村 联合村 云坛村 双河社区 石盘村 石龙村 石庙村 黄石村 白塔村 九盘村 海棠村 湛家村"}
{"水口镇": "水口场社区 徐月村 谢村村 石羊村 周陆村 周桥村 金坝村 石鼓村 雷坝村 张徐坝村 罗李坝村"}
{"土主镇": "土主场社区 铁牛村 红岩坝村 斗笠坳村 土门子村 金星村 杨家河村 石板冲村 红川村 花石岩村 桐子林村 高岩塘村"}
{"茅桥镇": "茅桥铺社区 茅桥村 吴桥村 斑竹村 石庙村 李家村 元口村 尹店村 石洞村"}
{"大佛街道": "篦子街社区 碧山路社区 大石桥社区 龙泓路社区 任家坝村 大佛坝村"}
{"青平镇": "青平村 保卫村 高堰村 青和村 太洪村 宝兴村 水竹村 八一村 张坝村 街村村"}
{"肖坝街道": "肖坝社区 共和社区 大田社区 青江社区 石龙社区 竹公溪社区"}
{"牟子镇": "牟子场社区 翡翠社区 沟儿口村 马边河村 三桥村 白果村 武皇村 老龙村 强华村 鸣凤村 菜莉村 槐子村"}
{"柏杨街道": "柏杨社区 茶坊社区 高墩子社区 牛耳桥社区"}
{"通江街道": "通江社区 岷河社区 长征社区 乐达社区 王河社区 敖坝社区 蟠龙社区 道座庙社区 檀木嘴村"}
{"泊水街道": "较场坝社区 县街社区 黄家山社区 白塔街社区 斑竹湾社区"}
{"上河街道": "新村街社区 人民西路社区 兴发街社区 府街社区 桂花楼社区 水井冲社区 紫云街社区"}
